{
  "backend/main.mo": "Main Motoko actor implementing user profiles, team members, events, gallery, projects, achievements, announcements, collaborations, resources, and registrations with role-based access control (admin/user permissions) and blob storage integration.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (About Us, Team, Events, Gallery, Projects, Achievements, Announcements, Collaborations, Resources, Join Us, Contact) to their source files, components, and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON summary of frontend files including React Query hooks, registration form, contact section, global OKLCH color styles, Tailwind config with warm academic theme, and profile setup modal.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark mode variables for a warm academic innovation theme with custom chart colors and sidebar styling.",
  "frontend/index.html": "HTML entry point for the Student Innovation Council application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component wrapping all sections (Hero, About, Team, Events, Gallery, Projects, Achievements, Announcements, Collaborations, Resources, Join Us, Contact) with QueryClient, ThemeProvider, Layout, ProfileSetupModal, and Toaster.",
  "frontend/src/components/AboutSection.tsx": "About section displaying the council's vision and four mission points (promote research, connect with industry, conduct events, support startups) with icons in a two-column grid layout.",
  "frontend/src/components/AchievementForm.tsx": "Dialog form for adding/editing achievements with fields for title, category, description, date, and recipients, plus delete and publish actions for admins with toast notifications.",
  "frontend/src/components/AchievementsSection.tsx": "Achievements section displaying categorized achievements (Student awards, Competition wins, Grants received, Research papers) sorted by date with admin edit/add capabilities and color-coded badges.",
  "frontend/src/components/AnnouncementForm.tsx": "A dialog form component for creating, editing, deleting, and publishing announcements with fields for title, content, and category. Integrates with backend mutations and displays toast notifications for user feedback.",
  "frontend/src/components/AnnouncementsSection.tsx": "Displays a list of public announcements sorted by timestamp with admin controls to create/edit posts. Shows announcement cards with category badges, timestamps, and formatted content.",
  "frontend/src/components/CollaborationForm.tsx": "A dialog form component for adding, editing, deleting, and publishing industry collaborations with fields for company name, problem statement, internship opportunity, and contact info. Uses backend mutations with toast notifications.",
  "frontend/src/components/CollaborationSection.tsx": "Displays a grid of industry collaboration cards showing company partnerships with optional problem statements, internship opportunities, and contact information. Includes admin controls for adding and editing collaborations.",
  "frontend/src/components/ContactSection.tsx": "A static contact information section displaying email, phone, office location, and social media links in a card grid layout. Uses icons from lucide-react and react-icons.",
  "frontend/src/components/EventForm.tsx": "A dialog form component for creating, editing, deleting, and publishing events with fields for name, date, description, outcomes, registration link, photos, and poster images. Handles file uploads via ExternalBlob and integrates with mutation hooks for CRUD operations.",
  "frontend/src/components/EventsSection.tsx": "Displays upcoming and past events in a tabbed interface with cards showing event details, posters, dates, and registration links. Provides admin controls to add/edit events and opens EventForm dialog for event management.",
  "frontend/src/components/GallerySection.tsx": "Displays a filterable image gallery organized by categories (Workshops, Hackathons, etc.) with lightbox preview functionality. Includes admin controls to upload new images via GalleryUploadForm dialog.",
  "frontend/src/components/GalleryUploadForm.tsx": "A dialog form for uploading gallery images with category selection, optional caption, and image file input. Handles image upload with progress tracking using ExternalBlob and publishes images after successful upload.",
  "frontend/src/components/HeroSection.tsx": "Landing hero section with background image, gradient overlay, and call-to-action buttons that scroll to 'Join Us' and 'Projects' sections. Displays the Student Innovation Council title and mission statement.",
  "frontend/src/components/JoinUsSection.tsx": "Registration form for students to join the council, requiring Internet Identity authentication. Displays existing registration status or allows new submissions with fields for name, branch, year, skills, and interest area.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, responsive navigation menu, logo, and footer with social links. Provides smooth scrolling to page sections and mobile menu toggle.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that handles Internet Identity login/logout with loading states. Clears query cache on logout and handles authentication errors.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name. Automatically shows when user is logged in but has no profile data.",
  "frontend/src/components/ProjectShowcaseSection.tsx": "Displays public projects and user's own projects in a grid layout. Allows authenticated users to submit projects and edit their own submissions, with admin override permissions.",
  "frontend/src/components/ProjectSubmissionForm.tsx": "Form dialog for creating and editing projects with fields for title, description, tech stack, team members, and demo link. Includes delete and admin publish functionality with toast notifications.",
  "frontend/src/components/ResourceForm.tsx": "Form dialog for adding and editing resources with categorization, description, and external links. Supports CRUD operations with admin controls and automatic publishing for new resources.",
  "frontend/src/components/ResourcesSection.tsx": "Displays categorized learning resources in a grid layout with external links. Admin users can add and edit resources through the ResourceForm modal.",
  "frontend/src/components/TeamMemberForm.tsx": "Dialog form component for adding/editing team members with photo upload, role selection, and publish/delete actions. Handles file uploads with progress tracking and uses mutations to interact with the backend.",
  "frontend/src/components/TeamSection.tsx": "Displays a grid of team member cards sorted by role hierarchy with admin controls for adding/editing members. Shows member photos, names, roles, and departments with conditional admin UI elements.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates and refetches queries when the actor changes due to identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Creates and manages AuthClient with configurable options and exposes identity state and login status throughout the app.",
  "frontend/src/hooks/useQueries.ts": "Defines all React Query hooks for data fetching and mutations including team members, events, gallery, projects, achievements, announcements, collaborations, resources, registrations, and user profiles. Each hook uses the actor from useActor and manages query invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors including primary, secondary, accent, and UI component colors. Defines color schemes for charts, sidebar, and semantic UI elements.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component. Creates the QueryClient instance and wraps the app with necessary context providers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support for maintaining state across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended theme properties including sidebar colors, custom animations, and typography/container-queries/animate plugins.",
  "project_state.json": "Project metadata for a Student Innovation Council web application defining architectural structure with 10 main sections (About, Team, Events, Gallery, Projects, Achievements, Announcements, Collaboration, Resources, Contact) and listing required hero/icon images."
}